Австралия/src/Catalogs/BusinessUnits/BusinessUnits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BusinessUnits</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>MainDepartment</name>
      <description>Main department</description>
    </items>
    <items>
      <name>MainWarehouse</name>
      <description>Main warehouse</description>
    </items>
    <items>
      <name>DropShipping</name>
      <description>Drop shipping</description>
    </items>
  </predefined>
  <attributes>
    <name>StructuralUnitType</name>
    <type>
      <types>EnumRef.BusinessUnitsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>FRP</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountInRetail</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>MarkupGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientOfWastes</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningInterval</name>
    <type>
      <types>EnumRef.PlanningIntervals</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningIntervalDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/AccumulationRegisters/POSSummary/POSSummary.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>POSSummary</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalesDocument</name>
    <type>
      <types>DocumentRef.CashReceipt</types>
    </type>
  </attributes>
  <attributes>
    <name>OfflineRecord</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Enums/BusinessUnitsTypes/BusinessUnitsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BusinessUnitsTypes</name>
  <enumValues>
    <name>Department</name>
  </enumValues>
  <enumValues>
    <name>Warehouse</name>
  </enumValues>
  <enumValues>
    <name>Retail</name>
  </enumValues>
  <enumValues>
    <name>RetailEarningAccounting</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/DefaultGLAccounts/DefaultGLAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DefaultGLAccounts</name>
  <predefined>
    <items>
      <name>AccountsPayable</name>
      <description>Accounts payable</description>
    </items>
    <items>
      <name>AccountsReceivable</name>
      <description>Accounts receivable</description>
    </items>
    <items>
      <name>AdvanceHolders</name>
      <description>Advance holders</description>
    </items>
    <items>
      <name>AdvanceHoldersPayable</name>
      <description>Advance holders payable</description>
    </items>
    <items>
      <name>AdvancesToSuppliers</name>
      <description>Advances to suppliers</description>
    </items>
    <items>
      <name>BankAccount</name>
      <description>Bank account</description>
    </items>
    <items>
      <name>BankFeesCreditAccount</name>
      <description>Bank fees credit account</description>
    </items>
    <items>
      <name>BankFeesExpenseAccount</name>
      <description>Bank fees expense account</description>
    </items>
    <items>
      <name>CapitalIntroduction</name>
      <description>Capital introduction</description>
    </items>
    <items>
      <name>CashAccount</name>
      <description>Cash account</description>
    </items>
    <items>
      <name>CommissionExpensesOnLoansBorrowed</name>
      <description>Commission expenses on loans borrowed</description>
    </items>
    <items>
      <name>CommissionIncomeOnLoansLent</name>
      <description>Commission income on loans lent</description>
    </items>
    <items>
      <name>CostOfSales</name>
      <description>Cost of sales</description>
    </items>
    <items>
      <name>CreditCardSalesReceivedAtALaterDate</name>
      <description>Credit card sales received at a later date</description>
    </items>
    <items>
      <name>CustomerAdvances</name>
      <description>Customer advances</description>
    </items>
    <items>
      <name>DiscountAllowed</name>
      <description>Discount allowed</description>
    </items>
    <items>
      <name>DiscountReceived</name>
      <description>Discount received</description>
    </items>
    <items>
      <name>Expenses</name>
      <description>Expenses</description>
    </items>
    <items>
      <name>FixedAssets</name>
      <description>Fixed assets</description>
    </items>
    <items>
      <name>FixedAssetsDepreciation</name>
      <description>Fixed assets depreciation</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeGain</name>
      <description>Foreign currency exchange gain</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeLoss</name>
      <description>Foreign currency exchange loss</description>
    </items>
    <items>
      <name>FundsTransfersBeingProcessed</name>
      <description>Funds transfers being processed</description>
    </items>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>IncomeSummary</name>
      <description>Income summary</description>
    </items>
    <items>
      <name>InterestExpensesOnLoansBorrowed</name>
      <description>Interest expenses on loans borrowed</description>
    </items>
    <items>
      <name>InterestIncome</name>
      <description>Interest income</description>
    </items>
    <items>
      <name>InterestPayable</name>
      <description>Interest payable</description>
    </items>
    <items>
      <name>InterestReceivable</name>
      <description>Interest receivable</description>
    </items>
    <items>
      <name>Inventory</name>
      <description>Inventory</description>
    </items>
    <items>
      <name>LoansBorrowed</name>
      <description>Loans borrowed</description>
    </items>
    <items>
      <name>LoansLentToCounerparty</name>
      <description>Loans lent to counterparty</description>
    </items>
    <items>
      <name>LoansLentToEmployee</name>
      <description>Loans lent to employee</description>
    </items>
    <items>
      <name>OpeningBalanceEquity</name>
      <description>Opening balance equity account (to balance opening entries)</description>
    </items>
    <items>
      <name>OtherIncome</name>
      <description>Other income</description>
    </items>
    <items>
      <name>PayrollExpenses</name>
      <description>Payroll expenses</description>
    </items>
    <items>
      <name>PayrollPayable</name>
      <description>Payroll payable</description>
    </items>
    <items>
      <name>PettyCashAccount</name>
      <description>Petty cash account</description>
    </items>
    <items>
      <name>PurchaseCostDiscrepancies</name>
      <description>Purchase cost discrepancies</description>
    </items>
    <items>
      <name>RetailMarkup</name>
      <description>Retail markup for retail inventory method</description>
    </items>
    <items>
      <name>TaxPayable</name>
      <description>Tax payable</description>
    </items>
    <items>
      <name>TaxRefund</name>
      <description>Tax refund</description>
    </items>
    <items>
      <name>VATInput</name>
      <description>VAT input</description>
    </items>
    <items>
      <name>VATAdvancesToSuppliers</name>
      <description>VAT on advance payments paid to suppliers</description>
    </items>
    <items>
      <name>VATAdvancesFromCustomers</name>
      <description>VAT on advance payments received from customers</description>
    </items>
    <items>
      <name>VATOutput</name>
      <description>VAT output</description>
    </items>
    <items>
      <name>VATReverseCharge</name>
      <description>VAT reverse charge</description>
    </items>
    <items>
      <name>WorkInProgress</name>
      <description>Work-in-progress</description>
    </items>
    <items>
      <name>WriteOffOverUnderMOHToCOGS</name>
      <description>Write-off over/underallocated manufacturing overheads to COGS</description>
    </items>
  </predefined>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/BusinessUnits/Forms/GLAccountsEditForm/Module.bsl
#Region GeneralPurposeProceduresAndFunctions

// Function checks account change option.
//
&AtServer
Function CancelGLAccountChange(Ref)
	
	SetPrivilegedMode(True);
	
	Query = New Query(
	"SELECT ALLOWED
	|	TRUE
	|FROM
	|	AccumulationRegister.POSSummary AS POSSummary
	|WHERE
	|	POSSummary.StructuralUnit = &StructuralUnit");
	
	Query.SetParameter("StructuralUnit", ?(ValueIsFilled(Ref), Ref, Undefined));
	
	Result = Query.Execute();
	
	Return Not Result.IsEmpty();
	
EndFunction

#EndRegion

#Region ProcedureFormEventHandlers

// Procedure - event handler OnCreateAtServer of the form.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	GLAccountInRetail = Parameters.GLAccountInRetail;
	MarkupGLAccount = Parameters.MarkupGLAccount;
	Ref = Parameters.Ref;
	
	If CancelGLAccountChange(Ref) Then
		Items.GLAccountsGroup.ToolTip = NStr("en = 'Records are registered for this retail outlet in the infobase. Cannot change the GL account.'; ru = 'В базе есть движения по этой розничной точке! Изменение счета учета запрещено!';pl = 'W bazie informacyjnej są zarejestrowane wpisy dla tego punktu sprzedaży. Nie można zmienić konta ewidencji.';es_ES = 'Grabaciones se han registrado para este punto de venta al por menor en la base de información. No se puede cambiar la cuenta del libro mayor.';es_CO = 'Grabaciones se han registrado para este punto de venta al por menor en la infobase. No se puede cambiar la cuenta del libro mayor.';tr = 'Infobase''de bu perakende satış noktası için kayıtlar mevcut. Muhasebe hesabı değiştirilemez.';it = 'Nel database ci sono movimenti per questo punto vendita! La modifica del conto mastro è vietata!';de = 'Die Datensätze werden für diese Verkaufsstelle in der Infobase registriert. Das Hauptbuch-Konto kann nicht geändert werden.'");
		Items.GLAccountsGroup.Enabled = False;
		Items.Default.Visible = False;
	EndIf;
	
	ThisIsRetailEarningAccounting = Ref.StructuralUnitType = Enums.BusinessUnitsTypes.RetailEarningAccounting;
	
EndProcedure

#EndRegion

#Region ProcedureActionsOfTheFormCommandPanels

// Procedure - command click handler Default.
//
&AtClient
Procedure Default(Command)
	
	DefaultAtServer();
	NotifyAboutSettlementAccountChange();
	
EndProcedure

&AtServer
Procedure DefaultAtServer()
	
	GLAccountInRetail	= GetDefaultGLAccount("Inventory");
	MarkupGLAccount		= GetDefaultGLAccount("RetailMarkup");
		
EndProcedure

&AtServerNoContext
Function GetDefaultGLAccount(Account)
	Return Catalogs.DefaultGLAccounts.GetDefaultGLAccount(Account);
EndFunction

&AtClient
Procedure NotifyAboutSettlementAccountChange()
	
	ParameterStructure = New Structure(
		"GLAccountInRetail, MarkupGLAccount",
		GLAccountInRetail, MarkupGLAccount
	);
	
	Notify("AccountsChangedBusinessUnits", ParameterStructure);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	If Not ThisIsRetailEarningAccounting Then
		Cancel = True;
		ShowMessageBox(, NStr("en = 'You can edit GL accounts only for POS with retail inventory method (RIM).'; ru = 'Счета учетов редактируются только для розницы с суммовым учетом!';pl = 'Możesz edytować konto księgowe tylko dla punktu sprzedaży metody inwentaryzacji w sprzedaży detalicznej.';es_ES = 'Usted puede editar las cuentas del libro mayor solo para TPV con el método de inventario de la venta al por menor (RIM).';es_CO = 'Usted puede editar las cuentas del libro mayor solo para TPV con el método de inventario de la venta al por menor (RIM).';tr = 'Muhasebe hesapları yalnızca envanter perakende yöntemi olan POS için düzenlenebilir.';it = 'È possibile modificare i conti mastro solo per i punti vendita al dettaglio e metodo dell''inventario (RIM).';de = 'Sie können die Hauptbuch-Konten nur für POS mit der Inventurmethode (Einzelhandel) bearbeiten.'"));
	EndIf;

EndProcedure

&AtClient
Procedure GLAccountInRetailOnChange(Item)
	
	If NOT ValueIsFilled(GLAccountInRetail) Then
		GLAccountInRetail = GetDefaultGLAccount("Inventory");
	EndIf;
	
	NotifyAboutSettlementAccountChange();
	
EndProcedure

&AtClient
Procedure MarkupGLAccountOnChange(Item)
	
	If NOT ValueIsFilled(MarkupGLAccount) Then
		MarkupGLAccount = GetDefaultGLAccount("RetailMarkup");
	EndIf;
	
	NotifyAboutSettlementAccountChange();
	
EndProcedure

#EndRegion
